*** replace ForwardErrorCorrectionMode::try_from with Ok(Default::default()) in src/parameters/option/fec_mode.rs:15
*** --- src/parameters/option/fec_mode.rs
+++ replace ForwardErrorCorrectionMode::try_from with Ok(Default::default())
@@ -8,22 +8,18 @@
     On,
     Off,
 }
 
 impl TryFrom<u8> for ForwardErrorCorrectionMode {
     type Error = super::Error;
 
     fn try_from(value: u8) -> Result<Self, Self::Error> {
-        match value {
-            0 => Ok(Self::Off),
-            1 => Ok(Self::On),
-            _ => Err(Error::InvalidFecMode { value }),
-        }
-    }
+Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
+}
 }
 
 impl From<ForwardErrorCorrectionMode> for u8 {
     fn from(mode: ForwardErrorCorrectionMode) -> Self {
         match mode {
             ForwardErrorCorrectionMode::Off => 0,
             ForwardErrorCorrectionMode::On => 1,
         }

---- parameters::test::from_to_bytes_roundtrip stdout ----
thread 'parameters::test::from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 34413, channel: 104, uart_parity: Even, uart_rate: Bps1200, air_rate: Bps2400, transmission_mode: Fixed, io_drive_mode: OpenCollector, wakeup_time: Ms1250, fec: On, transmission_power: Dbm24 }`,
 right: `Parameters { address: 34413, channel: 104, uart_parity: Even, uart_rate: Bps1200, air_rate: Bps2400, transmission_mode: Fixed, io_drive_mode: OpenCollector, wakeup_time: Ms1250, fec: Off, transmission_power: Dbm24 }`', src/parameters/mod.rs:143:13
thread 'parameters::test::from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 17206, channel: 104, uart_parity: Even, uart_rate: Bps1200, air_rate: Bps2400, transmission_mode: Fixed, io_drive_mode: OpenCol

---- test::parameters::read_params::reads_parameters stdout ----
thread 'test::parameters::read_params::reads_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 22114, channel: 196, uart_parity: None, uart_rate: Bps19200, air_rate: Bps9600, transmission_mode: Fixed, io_drive_mode: PushPull, wakeup_time: Ms1750, fec: On, transmission_power: Dbm24 }`,
 right: `Parameters { address: 22114, channel: 196, uart_parity: None, uart_rate: Bps19200, air_rate: Bps9600, transmission_mode: Fixed, io_drive_mode: PushPull, wakeup_time: Ms1750, fec: Off, transmission_power: Dbm24 }`', src/test/parameters/read_params.rs:78:9
thread 'test::parameters::read_params::reads_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 11057, channel: 196, uart_parity: None, uart_rate: Bps19200, air_rate: Bps9600, transmission_mode: Fixed,

---- test::parameters::read_params::sets_parameters stdout ----
thread 'test::parameters::read_params::sets_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 52484, channel: 187, uart_parity: Even, uart_rate: Bps9600, air_rate: Bps2400, transmission_mode: Transparent, io_drive_mode: OpenCollector, wakeup_time: Ms1000, fec: On, transmission_power: Dbm30 }`,
 right: `Parameters { address: 52484, channel: 187, uart_parity: Even, uart_rate: Bps9600, air_rate: Bps2400, transmission_mode: Transparent, io_drive_mode: OpenCollector, wakeup_time: Ms1000, fec: Off, transmission_power: Dbm30 }`', src/test/parameters/read_params.rs:107:9
thread 'test::parameters::read_params::sets_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 26242, channel: 187, uart_parity: Even, uart_rate: Bps9600, air_rate: Bps2400, transmiss

failures:
    parameters::test::from_to_bytes_roundtrip
    test::parameters::read_params::reads_parameters
    test::parameters::read_params::sets_parameters

test result: FAILED. 15 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.68s

*** cargo result: Exited(101) in 2.887sc_mode.rs:15:17
