*** replace IoDriveMode::try_from with Ok(Default::default()) in src/parameters/option/io_drive_mode.rs:15
*** --- src/parameters/option/io_drive_mode.rs
+++ replace IoDriveMode::try_from with Ok(Default::default())
@@ -8,22 +8,18 @@
     PushPull,
     OpenCollector,
 }
 
 impl TryFrom<u8> for IoDriveMode {
     type Error = super::Error;
 
     fn try_from(value: u8) -> Result<Self, Self::Error> {
-        match value {
-            0 => Ok(Self::OpenCollector),
-            1 => Ok(Self::PushPull),
-            _ => Err(Error::InvalidIoDriveMode { value }),
-        }
-    }
+Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
+}
 }
 
 impl From<IoDriveMode> for u8 {
     fn from(mode: IoDriveMode) -> Self {
         match mode {
             IoDriveMode::PushPull => 1,
             IoDriveMode::OpenCollector => 0,
         }

---- parameters::test::from_to_bytes_roundtrip stdout ----
thread 'parameters::test::from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 34413, channel: 104, uart_parity: Even, uart_rate: Bps1200, air_rate: Bps2400, transmission_mode: Fixed, io_drive_mode: PushPull, wakeup_time: Ms1250, fec: Off, transmission_power: Dbm24 }`,
 right: `Parameters { address: 34413, channel: 104, uart_parity: Even, uart_rate: Bps1200, air_rate: Bps2400, transmission_mode: Fixed, io_drive_mode: OpenCollector, wakeup_time: Ms1250, fec: Off, transmission_power: Dbm24 }`', src/parameters/mod.rs:143:13
thread 'parameters::test::from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 17206, channel: 104, uart_parity: Even, uart_rate: Bps1200, air_rate: Bps2400, transmission_mode: Fixed, io_drive_mode: PushPull, w

---- test::parameters::read_params::reads_parameters stdout ----
thread 'test::parameters::read_params::reads_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 18157, channel: 42, uart_parity: Odd, uart_rate: Bps9600, air_rate: Bps4800, transmission_mode: Transparent, io_drive_mode: PushPull, wakeup_time: Ms750, fec: On, transmission_power: Dbm21 }`,
 right: `Parameters { address: 18157, channel: 42, uart_parity: Odd, uart_rate: Bps9600, air_rate: Bps4800, transmission_mode: Transparent, io_drive_mode: OpenCollector, wakeup_time: Ms750, fec: On, transmission_power: Dbm21 }`', src/test/parameters/read_params.rs:78:9
thread 'test::parameters::read_params::reads_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 9078, channel: 42, uart_parity: Odd, uart_rate: Bps9600, air_rate: Bps4800, transmission_mode: Tra

---- test::parameters::read_params::sets_parameters stdout ----
thread 'test::parameters::read_params::sets_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 18157, channel: 42, uart_parity: Odd, uart_rate: Bps9600, air_rate: Bps4800, transmission_mode: Transparent, io_drive_mode: PushPull, wakeup_time: Ms750, fec: On, transmission_power: Dbm21 }`,
 right: `Parameters { address: 18157, channel: 42, uart_parity: Odd, uart_rate: Bps9600, air_rate: Bps4800, transmission_mode: Transparent, io_drive_mode: OpenCollector, wakeup_time: Ms750, fec: On, transmission_power: Dbm21 }`', src/test/parameters/read_params.rs:107:9
thread 'test::parameters::read_params::sets_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 9078, channel: 42, uart_parity: Odd, uart_rate: Bps9600, air_rate: Bps4800, transmission_mode: Trans

failures:
    parameters::test::from_to_bytes_roundtrip
    test::parameters::read_params::reads_parameters
    test::parameters::read_params::sets_parameters

test result: FAILED. 15 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.65s

*** cargo result: Exited(101) in 2.822son/io_drive_mode.rs
