*** replace <??>::read_model_data with Ok(Default::default()) in src/lib.rs:162
*** --- src/lib.rs
+++ replace <??>::read_model_data with Ok(Default::default())
@@ -155,35 +155,18 @@
 where
     S: Read<u8> + Write<u8>,
     Aux: InputPin,
     M0: OutputPin,
     M1: OutputPin,
     D: DelayMs<u32>,
 {
     pub fn read_model_data(&mut self) -> Result<ModelData, Error> {
-        block!(self.serial.write(0xC3)).map_err(|_| Error::SerialWrite)?;
-        block!(self.serial.write(0xC3)).map_err(|_| Error::SerialWrite)?;
-        block!(self.serial.write(0xC3)).map_err(|_| Error::SerialWrite)?;
-
-        let save = block!(self.serial.read()).map_err(|_| Error::SerialRead)?;
-        let model = block!(self.serial.read()).map_err(|_| Error::SerialRead)?;
-        let version = block!(self.serial.read()).map_err(|_| Error::SerialRead)?;
-        let features = block!(self.serial.read()).map_err(|_| Error::SerialRead)?;
-
-        if save == 0xC3 {
-            Ok(ModelData {
-                model,
-                version,
-                features,
-            })
-        } else {
-            Err(Error::ReadModelData)
-        }
-    }
+Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
+}
 
     pub fn read_parameters(&mut self) -> Result<Parameters, Error> {
         block!(self.serial.write(0xC1)).map_err(|_| Error::SerialWrite)?;
         block!(self.serial.write(0xC1)).map_err(|_| Error::SerialWrite)?;
         block!(self.serial.write(0xC1)).map_err(|_| Error::SerialWrite)?;
 
         let save = block!(self.serial.read()).map_err(|_| Error::SerialRead)?;

---- test::read_model::reads_model_data stdout ----
thread 'test::read_model::reads_model_data' panicked at 'assertion failed: `(left == right)`
  left: `ModelData { model: 0, version: 0, features: 0 }`,
 right: `ModelData { model: 178, version: 55, features: 224 }`', src/test/read_model.rs:76:9
thread 'test::read_model::reads_model_data' panicked at 'assertion failed: `(left == right)`
  left: `ModelData { model: 0, version: 0, features: 0 }`,
 right: `ModelData { model: 89, version: 55, features: 224 }`', src/test/read_model.rs:76:9
thread 'test::read_model::reads_model_data' panicked at 'assertion failed: `(left == right)`
  left: `ModelData { model: 0, version: 0, features: 0 }`,
 right: `ModelData { model: 44, version: 55, features: 224 }`', src/test/read_model.rs:76:9
thread 'test::read_model::reads_model_data' panicked at 'assertion failed: `(left == right)`
  left: `ModelData { m

failures:
    test::read_model::reads_model_data

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.74s

*** cargo result: Exited(101) in 2.938s2qSz5l)
