*** replace <??>::read with Ok(Default::default()) in src/lib.rs:125
*** --- src/lib.rs
+++ replace <??>::read with Ok(Default::default())
@@ -118,18 +118,18 @@
     Aux: InputPin,
     M0: OutputPin,
     M1: OutputPin,
     D: DelayMs<u32>,
 {
     type Error = <S as Read<u8>>::Error;
 
     fn read(&mut self) -> nb::Result<u8, Self::Error> {
-        self.serial.read()
-    }
+Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
+}
 }
 
 /// Implement Write for Hc12 in normal mode.
 /// This just defers to the underlying serial implementation.
 impl<S, Aux, M0, M1, D> Write<u8> for Ebyte<S, Aux, M0, M1, D, Normal>
 where
     S: Read<u8> + Write<u8>,
     Aux: InputPin,

---- test::reads_byte stdout ----
thread 'test::reads_byte' panicked at 'assertion failed: `(left == right)`
  left: `0`,
 right: `189`', src/test/mod.rs:125:9
thread 'test::reads_byte' panicked at 'assertion failed: `(left == right)`
  left: `0`,
 right: `94`', src/test/mod.rs:125:9
thread 'test::reads_byte' panicked at 'assertion failed: `(left == right)`
  left: `0`,
 right: `47`', src/test/mod.rs:125:9
thread 'test::reads_byte' panicked at 'assertion failed: `(left == right)`
  left: `0`,
 right: `23`', src/test/mod.rs:125:9
thread 'test::reads_byte' panicked at 'assertion failed: `(left == right)`

failures:
    test::reads_byte

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.73s

*** cargo result: Exited(101) in 2.937s2qSz5l)
