*** replace <??>::until_aux with () in src/lib.rs:243
*** --- src/lib.rs
+++ replace <??>::until_aux with ()
@@ -236,26 +236,18 @@
         let _ = block!(self.serial.write(0xC4));
         let _ = block!(self.serial.write(0xC4));
         let _ = block!(self.serial.write(0xC4));
 
         self.until_aux();
     }
 
     fn until_aux(&mut self) {
-        loop {
-            // TODO timeouts?
-            match self.aux.is_low() {
-                Ok(true) => continue,
-                Ok(false) => break,
-                // TODO error handling.
-                Err(_e) => panic!("failed to wait for aux pin"),
-            }
-        }
-    }
+() /* ~ changed by cargo-mutants ~ */
+}
 
     pub fn into_normal_mode(mut self) -> Ebyte<S, Aux, M0, M1, D, Normal> {
         Normal::set_pins(&mut self.aux, &mut self.m0, &mut self.m1, &mut self.delay);
         Ebyte {
             serial: self.serial,
             aux: self.aux,
             m0: self.m0,
             m1: self.m1,

---- test::resets stdout ----
thread 'test::resets' panicked at 'assertion failed: `(left == right)`
  left: `2`,
 right: `4`: Mock call number(left) and expectations(right) do not match', /home/rafaelbachmann/.cargo/registry/src/github.com-1ecc6299db9ec823/embedded-hal-mock-0.8.0/src/common.rs:56:9

---- test::parameters::set_params::sets_parameters stdout ----
thread 'test::parameters::set_params::sets_parameters' panicked at 'assertion failed: `(left == right)`
  left: `5`,
 right: `7`: Mock call number(left) and expectations(right) do not match', /home/rafaelbachmann/.cargo/registry/src/github.com-1ecc6299db9ec823/embedded-hal-mock-0.8.0/src/common.rs:56:9
thread 'test::parameters::set_params::sets_parameters' panicked at 'assertion failed: `(left == right)`
  left: `5`,
 right: `7`: Mock call number(left) and expectations(right) do not match', /home/rafaelbachmann/.cargo/registry/src/github.com-1ecc6299db9ec823/embedded-hal-mock-0.8.0/src/common.rs:56:9
thread 'test::parameters::set_params::sets_parameters' panicked at 'assertion failed: `(left == right)`
  left: `5`,
 right: `7`: Mock call number(left) and expectations(right) do not match', /home/rafaelbachmann/.cargo/registry/

failures:
    test::parameters::set_params::sets_parameters
    test::resets

test result: FAILED. 16 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.55s

*** cargo result: Exited(101) in 2.756s2qSz5l)
