*** replace AirBaudRate::try_from with Ok(Default::default()) in src/parameters/air_baudrate.rs:19
*** --- src/parameters/air_baudrate.rs
+++ replace AirBaudRate::try_from with Ok(Default::default())
@@ -12,26 +12,18 @@
     Bps9600,
     Bps19200,
 }
 
 impl TryFrom<u8> for AirBaudRate {
     type Error = super::Error;
 
     fn try_from(value: u8) -> Result<Self, Self::Error> {
-        match value {
-            0 => Ok(Self::Bps300),
-            1 => Ok(Self::Bps1200),
-            2 => Ok(Self::Bps2400),
-            3 => Ok(Self::Bps4800),
-            4 => Ok(Self::Bps9600),
-            5 | 6 | 7 => Ok(Self::Bps19200),
-            _ => Err(Error::InvalidBaudrate { rate: value }),
-        }
-    }
+Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
+}
 }
 
 impl From<AirBaudRate> for u8 {
     fn from(rate: AirBaudRate) -> Self {
         match rate {
             AirBaudRate::Bps300 => 0,
             AirBaudRate::Bps1200 => 1,
             AirBaudRate::Bps2400 => 2,

---- parameters::test::from_to_bytes_roundtrip stdout ----
thread 'parameters::test::from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 20172, channel: 54, uart_parity: Odd, uart_rate: Bps19200, air_rate: Bps2400, transmission_mode: Transparent, io_drive_mode: PushPull, wakeup_time: Ms500, fec: On, transmission_power: Dbm24 }`,
 right: `Parameters { address: 20172, channel: 54, uart_parity: Odd, uart_rate: Bps19200, air_rate: Bps4800, transmission_mode: Transparent, io_drive_mode: PushPull, wakeup_time: Ms500, fec: On, transmission_power: Dbm24 }`', src/parameters/mod.rs:143:13
thread 'parameters::test::from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 10086, channel: 54, uart_parity: Odd, uart_rate: Bps19200, air_rate: Bps2400, transmission_mode: Transparent, io_drive_mode: PushP

---- test::parameters::read_params::reads_parameters stdout ----
thread 'test::parameters::read_params::reads_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 59766, channel: 126, uart_parity: None, uart_rate: Bps2400, air_rate: Bps2400, transmission_mode: Fixed, io_drive_mode: OpenCollector, wakeup_time: Ms1500, fec: Off, transmission_power: Dbm24 }`,
 right: `Parameters { address: 59766, channel: 126, uart_parity: None, uart_rate: Bps2400, air_rate: Bps19200, transmission_mode: Fixed, io_drive_mode: OpenCollector, wakeup_time: Ms1500, fec: Off, transmission_power: Dbm24 }`', src/test/parameters/read_params.rs:78:9
thread 'test::parameters::read_params::reads_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 29883, channel: 126, uart_parity: None, uart_rate: Bps2400, air_rate: Bps2400, transmission_mode

---- test::parameters::read_params::sets_parameters stdout ----
thread 'test::parameters::read_params::sets_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 41554, channel: 127, uart_parity: Odd, uart_rate: Bps9600, air_rate: Bps2400, transmission_mode: Fixed, io_drive_mode: OpenCollector, wakeup_time: Ms2000, fec: On, transmission_power: Dbm21 }`,
 right: `Parameters { address: 41554, channel: 127, uart_parity: Odd, uart_rate: Bps9600, air_rate: Bps300, transmission_mode: Fixed, io_drive_mode: OpenCollector, wakeup_time: Ms2000, fec: On, transmission_power: Dbm21 }`', src/test/parameters/read_params.rs:107:9
thread 'test::parameters::read_params::sets_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 20777, channel: 127, uart_parity: Odd, uart_rate: Bps9600, air_rate: Bps2400, transmission_mode: Fixed,

failures:
    parameters::test::from_to_bytes_roundtrip
    test::parameters::read_params::reads_parameters
    test::parameters::read_params::sets_parameters

test result: FAILED. 15 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.83s

*** cargo result: Exited(101) in 3.057s.rs:19:17
