*** replace BaudRate::try_from with Ok(Default::default()) in src/parameters/baudrate.rs:21
*** --- src/parameters/baudrate.rs
+++ replace BaudRate::try_from with Ok(Default::default())
@@ -14,28 +14,18 @@
     Bps57600,
     Bps115200,
 }
 
 impl TryFrom<u8> for BaudRate {
     type Error = super::Error;
 
     fn try_from(value: u8) -> Result<Self, Self::Error> {
-        match value {
-            0 => Ok(Self::Bps1200),
-            1 => Ok(Self::Bps2400),
-            2 => Ok(Self::Bps4800),
-            3 => Ok(Self::Bps9600),
-            4 => Ok(Self::Bps19200),
-            5 => Ok(Self::Bps38400),
-            6 => Ok(Self::Bps57600),
-            7 => Ok(Self::Bps115200),
-            _ => Err(Error::InvalidBaudrate { rate: value }),
-        }
-    }
+Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
+}
 }
 
 impl From<BaudRate> for u8 {
     fn from(rate: BaudRate) -> Self {
         match rate {
             BaudRate::Bps1200 => 0,
             BaudRate::Bps2400 => 1,
             BaudRate::Bps4800 => 2,

---- parameters::test::from_to_bytes_roundtrip stdout ----
thread 'parameters::test::from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 20172, channel: 54, uart_parity: Odd, uart_rate: Bps9600, air_rate: Bps4800, transmission_mode: Transparent, io_drive_mode: PushPull, wakeup_time: Ms500, fec: On, transmission_power: Dbm24 }`,
 right: `Parameters { address: 20172, channel: 54, uart_parity: Odd, uart_rate: Bps19200, air_rate: Bps4800, transmission_mode: Transparent, io_drive_mode: PushPull, wakeup_time: Ms500, fec: On, transmission_power: Dbm24 }`', src/parameters/mod.rs:143:13
thread 'parameters::test::from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 10086, channel: 54, uart_parity: Odd, uart_rate: Bps9600, air_rate: Bps4800, transmission_mode: Transparent, io_drive_mode: PushPul

---- test::parameters::read_params::reads_parameters stdout ----
thread 'test::parameters::read_params::reads_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 59766, channel: 126, uart_parity: None, uart_rate: Bps9600, air_rate: Bps19200, transmission_mode: Fixed, io_drive_mode: OpenCollector, wakeup_time: Ms1500, fec: Off, transmission_power: Dbm24 }`,
 right: `Parameters { address: 59766, channel: 126, uart_parity: None, uart_rate: Bps2400, air_rate: Bps19200, transmission_mode: Fixed, io_drive_mode: OpenCollector, wakeup_time: Ms1500, fec: Off, transmission_power: Dbm24 }`', src/test/parameters/read_params.rs:78:9
thread 'test::parameters::read_params::reads_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 29883, channel: 126, uart_parity: None, uart_rate: Bps9600, air_rate: Bps19200, transmission_mo

---- test::parameters::read_params::sets_parameters stdout ----
thread 'test::parameters::read_params::sets_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 59766, channel: 126, uart_parity: None, uart_rate: Bps9600, air_rate: Bps19200, transmission_mode: Fixed, io_drive_mode: OpenCollector, wakeup_time: Ms1500, fec: Off, transmission_power: Dbm24 }`,
 right: `Parameters { address: 59766, channel: 126, uart_parity: None, uart_rate: Bps2400, air_rate: Bps19200, transmission_mode: Fixed, io_drive_mode: OpenCollector, wakeup_time: Ms1500, fec: Off, transmission_power: Dbm24 }`', src/test/parameters/read_params.rs:107:9
thread 'test::parameters::read_params::sets_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 29883, channel: 126, uart_parity: None, uart_rate: Bps9600, air_rate: Bps19200, transmission_mode

failures:
    parameters::test::from_to_bytes_roundtrip
    test::parameters::read_params::reads_parameters
    test::parameters::read_params::sets_parameters

test result: FAILED. 15 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.86s

*** cargo result: Exited(101) in 3.060s7
