*** replace ModelData::from_bytes with Ok(Default::default()) in src/model_data.rs:16
*** --- src/model_data.rs
+++ replace ModelData::from_bytes with Ok(Default::default())
@@ -9,22 +9,18 @@
 }
 
 impl ModelData {
     pub fn to_bytes(self) -> [u8; 3] {
         [self.model, self.version, self.features]
     }
 
     pub fn from_bytes(bytes: &[u8; 3]) -> Result<Self, Error> {
-        Ok(Self {
-            model: bytes[0],
-            version: bytes[1],
-            features: bytes[2],
-        })
-    }
+Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
+}
 }
 
 #[cfg(test)]
 mod test {
     use crate::model_data::ModelData;
     use proptest::prelude::*;
 
     proptest! {

---- model_data::test::model_data_from_to_bytes_roundtrip stdout ----
thread 'model_data::test::model_data_from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `ModelData { model: 99, version: 186, features: 155 }`,
 right: `ModelData { model: 0, version: 0, features: 0 }`', src/model_data.rs:31:13
thread 'model_data::test::model_data_from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `ModelData { model: 49, version: 186, features: 155 }`,
 right: `ModelData { model: 0, version: 0, features: 0 }`', src/model_data.rs:31:13
thread 'model_data::test::model_data_from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `ModelData { model: 24, version: 186, features: 155 }`,
 right: `ModelData { model: 0, version: 0, features: 0 }`', src/model_data.rs:31:13
thread 'model_data::test::model_data_from_to_bytes_ro

failures:
    model_data::test::model_data_from_to_bytes_roundtrip

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.76s

*** cargo result: Exited(101) in 3.039ssed_variables)]` on
