*** replace ModelData::to_bytes with Default::default() in src/model_data.rs:12
*** --- src/model_data.rs
+++ replace ModelData::to_bytes with Default::default()
@@ -5,18 +5,18 @@
 pub struct ModelData {
     pub model: u8,
     pub version: u8,
     pub features: u8,
 }
 
 impl ModelData {
     pub fn to_bytes(self) -> [u8; 3] {
-        [self.model, self.version, self.features]
-    }
+Default::default() /* ~ changed by cargo-mutants ~ */
+}
 
     pub fn from_bytes(bytes: &[u8; 3]) -> Result<Self, Error> {
         Ok(Self {
             model: bytes[0],
             version: bytes[1],
             features: bytes[2],
         })
     }

---- model_data::test::model_data_from_to_bytes_roundtrip stdout ----
thread 'model_data::test::model_data_from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `ModelData { model: 28, version: 243, features: 186 }`,
 right: `ModelData { model: 0, version: 0, features: 0 }`', src/model_data.rs:35:13
thread 'model_data::test::model_data_from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `ModelData { model: 14, version: 243, features: 186 }`,
 right: `ModelData { model: 0, version: 0, features: 0 }`', src/model_data.rs:35:13
thread 'model_data::test::model_data_from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `ModelData { model: 7, version: 243, features: 186 }`,
 right: `ModelData { model: 0, version: 0, features: 0 }`', src/model_data.rs:35:13
thread 'model_data::test::model_data_from_to_bytes_rou

---- test::read_model::reads_model_data stdout ----
thread 'test::read_model::reads_model_data' panicked at 'assertion failed: `(left == right)`
  left: `ModelData { model: 0, version: 0, features: 0 }`,
 right: `ModelData { model: 156, version: 26, features: 193 }`', src/test/read_model.rs:76:9
thread 'test::read_model::reads_model_data' panicked at 'assertion failed: `(left == right)`
  left: `ModelData { model: 0, version: 0, features: 0 }`,
 right: `ModelData { model: 78, version: 26, features: 193 }`', src/test/read_model.rs:76:9
thread 'test::read_model::reads_model_data' panicked at 'assertion failed: `(left == right)`
  left: `ModelData { model: 0, version: 0, features: 0 }`,
 right: `ModelData { model: 39, version: 26, features: 193 }`', src/test/read_model.rs:76:9
thread 'test::read_model::reads_model_data' panicked at 'assertion failed: `(left == right)`
  left: `ModelData { m

failures:
    model_data::test::model_data_from_to_bytes_roundtrip
    test::read_model::reads_model_data

test result: FAILED. 16 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.98s

*** cargo result: Exited(101) in 3.192sJFXww7)
