*** replace Parameters::to_bytes with Default::default() in src/parameters/mod.rs:60
*** --- src/parameters/mod.rs
+++ replace Parameters::to_bytes with Default::default()
@@ -53,42 +53,18 @@
     #[builder(default)]
     pub fec: ForwardErrorCorrectionMode,
     #[builder(default)]
     pub transmission_power: TransmissionPower,
 }
 
 impl Parameters {
     pub fn to_bytes(&self) -> [u8; 5] {
-        let mut bytes = [0u8; 5];
-        bytes[0] = ((0xFF00 & self.address) >> 8) as u8;
-        bytes[1] = (0x00FF & self.address) as u8;
-
-        let parity = u8::from(self.uart_parity);
-        let uart_rate = u8::from(self.uart_rate);
-        let air_rate = u8::from(self.air_rate);
-        let speed_byte = (parity << 6) | (uart_rate << 3) | air_rate;
-        bytes[2] = speed_byte;
-
-        bytes[3] = self.channel;
-
-        let transmission_mode = u8::from(self.transmission_mode);
-        let io_drive_mode = u8::from(self.io_drive_mode);
-        let wakeup_time = u8::from(self.wakeup_time);
-        let fec = u8::from(self.fec);
-        let transmission_power = u8::from(self.transmission_power);
-        let options = (transmission_mode << 7)
-            | (io_drive_mode << 6)
-            | (wakeup_time << 3)
-            | (fec << 2)
-            | transmission_power;
-        bytes[4] = options;
-
-        bytes
-    }
+Default::default() /* ~ changed by cargo-mutants ~ */
+}
 
     pub fn from_bytes(bytes: &[u8; 5]) -> Result<Self, Error> {
         let address_high = bytes[0];
         let address_low = bytes[1];
         let speed = bytes[2];
         let channel = bytes[3];
         let options = bytes[4];
         let address = (address_high as u16) << 8 | address_low as u16;

---- parameters::test::from_to_bytes_roundtrip stdout ----
thread 'parameters::test::from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 0, channel: 0, uart_parity: None, uart_rate: Bps1200, air_rate: Bps300, transmission_mode: Transparent, io_drive_mode: OpenCollector, wakeup_time: Ms250, fec: Off, transmission_power: Dbm30 }`,
 right: `Parameters { address: 20172, channel: 54, uart_parity: Odd, uart_rate: Bps19200, air_rate: Bps4800, transmission_mode: Transparent, io_drive_mode: PushPull, wakeup_time: Ms500, fec: On, transmission_power: Dbm24 }`', src/parameters/mod.rs:119:13
thread 'parameters::test::from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 0, channel: 0, uart_parity: None, uart_rate: Bps1200, air_rate: Bps300, transmission_mode: Transparent, io_drive_mode: OpenCollect

---- test::parameters::read_params::sets_parameters stdout ----
thread 'test::parameters::read_params::sets_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 0, channel: 0, uart_parity: None, uart_rate: Bps1200, air_rate: Bps300, transmission_mode: Transparent, io_drive_mode: OpenCollector, wakeup_time: Ms250, fec: Off, transmission_power: Dbm30 }`,
 right: `Parameters { address: 38344, channel: 139, uart_parity: None, uart_rate: Bps115200, air_rate: Bps19200, transmission_mode: Transparent, io_drive_mode: PushPull, wakeup_time: Ms250, fec: Off, transmission_power: Dbm21 }`', src/test/parameters/read_params.rs:107:9
thread 'test::parameters::read_params::sets_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 0, channel: 0, uart_parity: None, uart_rate: Bps1200, air_rate: Bps300, transmission_mode: Transpa

---- test::parameters::read_params::reads_parameters stdout ----
thread 'test::parameters::read_params::reads_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 0, channel: 0, uart_parity: None, uart_rate: Bps1200, air_rate: Bps300, transmission_mode: Transparent, io_drive_mode: OpenCollector, wakeup_time: Ms250, fec: Off, transmission_power: Dbm30 }`,
 right: `Parameters { address: 38344, channel: 139, uart_parity: None, uart_rate: Bps115200, air_rate: Bps19200, transmission_mode: Transparent, io_drive_mode: PushPull, wakeup_time: Ms250, fec: Off, transmission_power: Dbm21 }`', src/test/parameters/read_params.rs:78:9
thread 'test::parameters::read_params::reads_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 0, channel: 0, uart_parity: None, uart_rate: Bps1200, air_rate: Bps300, transmission_mode: Trans

failures:
    parameters::test::from_to_bytes_roundtrip
    test::parameters::read_params::reads_parameters
    test::parameters::read_params::sets_parameters

test result: FAILED. 15 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.64s

*** cargo result: Exited(101) in 2.860spZEA6P)
