*** replace Parity::try_from with Ok(Default::default()) in src/parameters/uart_parity.rs:16
*** --- src/parameters/uart_parity.rs
+++ replace Parity::try_from with Ok(Default::default())
@@ -9,23 +9,18 @@
     Odd,
     Even,
 }
 
 impl TryFrom<u8> for Parity {
     type Error = super::Error;
 
     fn try_from(value: u8) -> Result<Self, Self::Error> {
-        match value {
-            0 | 3 => Ok(Self::None),
-            1 => Ok(Self::Odd),
-            2 => Ok(Self::Even),
-            _ => Err(Error::InvalidUartParity { value }),
-        }
-    }
+Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
+}
 }
 
 impl From<Parity> for u8 {
     fn from(parity: Parity) -> Self {
         match parity {
             Parity::None => 0,
             Parity::Odd => 1,
             Parity::Even => 2,

---- parameters::test::from_to_bytes_roundtrip stdout ----
thread 'parameters::test::from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 20172, channel: 54, uart_parity: None, uart_rate: Bps19200, air_rate: Bps4800, transmission_mode: Transparent, io_drive_mode: PushPull, wakeup_time: Ms500, fec: On, transmission_power: Dbm24 }`,
 right: `Parameters { address: 20172, channel: 54, uart_parity: Odd, uart_rate: Bps19200, air_rate: Bps4800, transmission_mode: Transparent, io_drive_mode: PushPull, wakeup_time: Ms500, fec: On, transmission_power: Dbm24 }`', src/parameters/mod.rs:143:13
thread 'parameters::test::from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 10086, channel: 54, uart_parity: None, uart_rate: Bps19200, air_rate: Bps4800, transmission_mode: Transparent, io_drive_mode: Pus

---- test::parameters::read_params::reads_parameters stdout ----
thread 'test::parameters::read_params::reads_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 65268, channel: 101, uart_parity: None, uart_rate: Bps4800, air_rate: Bps300, transmission_mode: Fixed, io_drive_mode: PushPull, wakeup_time: Ms250, fec: On, transmission_power: Dbm27 }`,
 right: `Parameters { address: 65268, channel: 101, uart_parity: Odd, uart_rate: Bps4800, air_rate: Bps300, transmission_mode: Fixed, io_drive_mode: PushPull, wakeup_time: Ms250, fec: On, transmission_power: Dbm27 }`', src/test/parameters/read_params.rs:78:9
thread 'test::parameters::read_params::reads_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 32634, channel: 101, uart_parity: None, uart_rate: Bps4800, air_rate: Bps300, transmission_mode: Fixed, io_drive_m

---- test::parameters::read_params::sets_parameters stdout ----
thread 'test::parameters::read_params::sets_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 65268, channel: 101, uart_parity: None, uart_rate: Bps4800, air_rate: Bps300, transmission_mode: Fixed, io_drive_mode: PushPull, wakeup_time: Ms250, fec: On, transmission_power: Dbm27 }`,
 right: `Parameters { address: 65268, channel: 101, uart_parity: Odd, uart_rate: Bps4800, air_rate: Bps300, transmission_mode: Fixed, io_drive_mode: PushPull, wakeup_time: Ms250, fec: On, transmission_power: Dbm27 }`', src/test/parameters/read_params.rs:107:9
thread 'test::parameters::read_params::sets_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 32634, channel: 101, uart_parity: None, uart_rate: Bps4800, air_rate: Bps300, transmission_mode: Fixed, io_drive_mod

failures:
    parameters::test::from_to_bytes_roundtrip
    test::parameters::read_params::reads_parameters
    test::parameters::read_params::sets_parameters

test result: FAILED. 15 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.64s

*** cargo result: Exited(101) in 2.822ss:16:17
