*** replace TransmissionMode::try_from with Ok(Default::default()) in src/parameters/option/transmission_mode.rs:15
*** --- src/parameters/option/transmission_mode.rs
+++ replace TransmissionMode::try_from with Ok(Default::default())
@@ -8,22 +8,18 @@
     Transparent,
     Fixed,
 }
 
 impl TryFrom<u8> for TransmissionMode {
     type Error = super::Error;
 
     fn try_from(value: u8) -> Result<Self, Self::Error> {
-        match value {
-            0 => Ok(Self::Transparent),
-            1 => Ok(Self::Fixed),
-            _ => Err(Error::InvalidTransmissionMode { value }),
-        }
-    }
+Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
+}
 }
 
 impl From<TransmissionMode> for u8 {
     fn from(mode: TransmissionMode) -> Self {
         match mode {
             TransmissionMode::Transparent => 0,
             TransmissionMode::Fixed => 1,
         }

---- parameters::test::from_to_bytes_roundtrip stdout ----
thread 'parameters::test::from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 39958, channel: 80, uart_parity: Odd, uart_rate: Bps4800, air_rate: Bps300, transmission_mode: Transparent, io_drive_mode: OpenCollector, wakeup_time: Ms1750, fec: On, transmission_power: Dbm27 }`,
 right: `Parameters { address: 39958, channel: 80, uart_parity: Odd, uart_rate: Bps4800, air_rate: Bps300, transmission_mode: Fixed, io_drive_mode: OpenCollector, wakeup_time: Ms1750, fec: On, transmission_power: Dbm27 }`', src/parameters/mod.rs:143:13
thread 'parameters::test::from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 19979, channel: 80, uart_parity: Odd, uart_rate: Bps4800, air_rate: Bps300, transmission_mode: Transparent, io_drive_mode: OpenC

---- test::parameters::read_params::reads_parameters stdout ----
thread 'test::parameters::read_params::reads_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 59766, channel: 126, uart_parity: None, uart_rate: Bps2400, air_rate: Bps19200, transmission_mode: Transparent, io_drive_mode: OpenCollector, wakeup_time: Ms1500, fec: Off, transmission_power: Dbm24 }`,
 right: `Parameters { address: 59766, channel: 126, uart_parity: None, uart_rate: Bps2400, air_rate: Bps19200, transmission_mode: Fixed, io_drive_mode: OpenCollector, wakeup_time: Ms1500, fec: Off, transmission_power: Dbm24 }`', src/test/parameters/read_params.rs:78:9
thread 'test::parameters::read_params::reads_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 29883, channel: 126, uart_parity: None, uart_rate: Bps2400, air_rate: Bps19200, transmiss

---- test::parameters::read_params::sets_parameters stdout ----
thread 'test::parameters::read_params::sets_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 59766, channel: 126, uart_parity: None, uart_rate: Bps2400, air_rate: Bps19200, transmission_mode: Transparent, io_drive_mode: OpenCollector, wakeup_time: Ms1500, fec: Off, transmission_power: Dbm24 }`,
 right: `Parameters { address: 59766, channel: 126, uart_parity: None, uart_rate: Bps2400, air_rate: Bps19200, transmission_mode: Fixed, io_drive_mode: OpenCollector, wakeup_time: Ms1500, fec: Off, transmission_power: Dbm24 }`', src/test/parameters/read_params.rs:107:9
thread 'test::parameters::read_params::sets_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 29883, channel: 126, uart_parity: None, uart_rate: Bps2400, air_rate: Bps19200, transmissio

failures:
    parameters::test::from_to_bytes_roundtrip
    test::parameters::read_params::reads_parameters
    test::parameters::read_params::sets_parameters

test result: FAILED. 15 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.92s

*** cargo result: Exited(101) in 3.122soption/transmission
