*** replace <??>::flush with Ok(Default::default()) in src/lib.rs:146
*** --- src/lib.rs
+++ replace <??>::flush with Ok(Default::default())
@@ -139,18 +139,18 @@
 {
     type Error = <S as Write<u8>>::Error;
 
     fn write(&mut self, word: u8) -> nb::Result<(), Self::Error> {
         self.serial.write(word)
     }
 
     fn flush(&mut self) -> nb::Result<(), Self::Error> {
-        self.serial.flush()
-    }
+Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
+}
 }
 
 // TODO consider moving those methods to normal mode,
 // then do the mode switch inside the method.
 // Switching modes for the user right now involves a little too much typestate things.
 impl<S, Aux, M0, M1, D> Ebyte<S, Aux, M0, M1, D, Program>
 where
     S: Read<u8> + Write<u8>,

---- test::flushes stdout ----
thread 'test::flushes' panicked at 'serial mock has unsatisfied expectations after call to done', /home/rafaelbachmann/.cargo/registry/src/github.com-1ecc6299db9ec823/embedded-hal-mock-0.8.0/src/serial.rs:340:9

failures:
    test::flushes

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.73s

*** cargo result: Exited(101) in 2.972sW8Sm9N)
