*** replace <??>::model_data with Ok(Default::default()) in src/lib.rs:83
*** --- src/lib.rs
+++ replace <??>::model_data with Ok(Default::default())
@@ -76,21 +76,18 @@
     pub fn read_buffer(&mut self, buffer: &mut [u8]) -> Result<(), Error> {
         for byte in buffer {
             *byte = block!(self.serial.read()).map_err(|_| Error::SerialRead)?;
         }
         Ok(())
     }
 
     pub fn model_data(&mut self) -> Result<ModelData, Error> {
-        Program::set_pins(&mut self.aux, &mut self.m0, &mut self.m1, &mut self.delay);
-        let result = self.read_model_data();
-        Normal::set_pins(&mut self.aux, &mut self.m0, &mut self.m1, &mut self.delay);
-        result
-    }
+Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
+}
 
     fn read_model_data(&mut self) -> Result<ModelData, Error> {
         block!(self.serial.write(0xC3)).map_err(|_| Error::SerialWrite)?;
         block!(self.serial.write(0xC3)).map_err(|_| Error::SerialWrite)?;
         block!(self.serial.write(0xC3)).map_err(|_| Error::SerialWrite)?;
 
         let save = block!(self.serial.read()).map_err(|_| Error::SerialRead)?;
         let model = block!(self.serial.read()).map_err(|_| Error::SerialRead)?;

---- test::read_model::reads_model_data stdout ----
thread 'test::read_model::reads_model_data' panicked at 'assertion failed: `(left == right)`
  left: `ModelData { model: 0, version: 0, features: 0 }`,
 right: `ModelData { model: 92, version: 254, features: 139 }`', src/test/read_model.rs:77:9
thread 'test::read_model::reads_model_data' panicked at 'assertion failed: `(left == right)`
  left: `ModelData { model: 0, version: 0, features: 0 }`,
 right: `ModelData { model: 46, version: 254, features: 139 }`', src/test/read_model.rs:77:9
thread 'test::read_model::reads_model_data' panicked at 'assertion failed: `(left == right)`
  left: `ModelData { model: 0, version: 0, features: 0 }`,
 right: `ModelData { model: 23, version: 254, features: 139 }`', src/test/read_model.rs:77:9
thread 'test::read_model::reads_model_data' panicked at 'assertion failed: `(left == right)`
  left: `ModelData {

failures:
    test::read_model::reads_model_data

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.78s

*** cargo result: Exited(101) in 3.039st) generated 1 warn
