*** replace <??>::perform_reset with Ok(Default::default()) in src/lib.rs:177
*** --- src/lib.rs
+++ replace <??>::perform_reset with Ok(Default::default())
@@ -170,22 +170,18 @@
     pub fn reset(&mut self) -> Result<(), Error> {
         Program::set_pins(&mut self.aux, &mut self.m0, &mut self.m1, &mut self.delay);
         let result = self.perform_reset();
         Normal::set_pins(&mut self.aux, &mut self.m0, &mut self.m1, &mut self.delay);
         result
     }
 
     fn perform_reset(&mut self) -> Result<(), Error> {
-        block!(self.serial.write(0xC4)).map_err(|_| Error::SerialWrite)?;
-        block!(self.serial.write(0xC4)).map_err(|_| Error::SerialWrite)?;
-        block!(self.serial.write(0xC4)).map_err(|_| Error::SerialWrite)?;
-
-        Ok(())
-    }
+Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
+}
 
     pub fn release(self) -> (S, Aux, M0, M1, D) {
         (self.serial, self.aux, self.m0, self.m1, self.delay)
     }
 }
 
 impl<S, Aux, M0, M1, D> Read<u8> for Ebyte<S, Aux, M0, M1, D, Normal>
 where

---- test::resets stdout ----
thread 'test::resets' panicked at 'serial mock has unsatisfied expectations after call to done', /home/rafaelbachmann/.cargo/registry/src/github.com-1ecc6299db9ec823/embedded-hal-mock-0.8.0/src/serial.rs:340:9

failures:
    test::resets

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.74s

*** cargo result: Exited(101) in 3.007sOK8bDN)
