*** replace <??>::read_buffer with Ok(Default::default()) in src/lib.rs:76
*** --- src/lib.rs
+++ replace <??>::read_buffer with Ok(Default::default())
@@ -69,21 +69,18 @@
         for ch in buffer {
             block!(self.serial.write(*ch)).map_err(|_| Error::SerialWrite)?;
         }
         Ok(())
     }
 
     /// Read entire buffer from serial port
     pub fn read_buffer(&mut self, buffer: &mut [u8]) -> Result<(), Error> {
-        for byte in buffer {
-            *byte = block!(self.serial.read()).map_err(|_| Error::SerialRead)?;
-        }
-        Ok(())
-    }
+Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
+}
 
     pub fn model_data(&mut self) -> Result<ModelData, Error> {
         Program::set_pins(&mut self.aux, &mut self.m0, &mut self.m1, &mut self.delay);
         let result = self.read_model_data();
         Normal::set_pins(&mut self.aux, &mut self.m0, &mut self.m1, &mut self.delay);
         result
     }

---- test::reads_buffer stdout ----
thread 'test::reads_buffer' panicked at 'assertion failed: `(left == right)`
  left: `[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]`,
 right: `[189, 172, 197, 211, 224, 209, 255, 91, 53, 58, 98, 227, 45, 219, 40, 42]`', src/test/mod.rs:177:9
thread 'test::reads_buffer' panicked at 'assertion failed: `(left == right)`
  left: `[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]`,
 right: `[94, 172, 197, 211, 224, 209, 255, 91, 53, 58, 98, 227, 45, 219, 40, 42]`', src/test/mod.rs:177:9
thread 'test::reads_buffer' panicked at 'assertion failed: `(left == right)`
  left: `[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]`,
 right: `[47, 172, 197, 211, 224, 209, 255, 91, 53, 58, 98, 227, 45, 219, 40, 42]`', src/test/mod.rs:177:9
thread 'test::reads_buffer' panicked at 'assertion failed: `(left == right)`
  left: `[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,

failures:
    test::reads_buffer

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.89s

*** cargo result: Exited(101) in 3.161s = note: `#[warn(un
