*** replace <??>::reset with () in src/lib.rs:235
*** --- src/lib.rs
+++ replace <??>::reset with ()
@@ -228,22 +228,18 @@
         self.delay.delay_ms(40);
 
         self.until_aux();
 
         Ok(())
     }
 
     pub fn reset(&mut self) {
-        let _ = block!(self.serial.write(0xC4));
-        let _ = block!(self.serial.write(0xC4));
-        let _ = block!(self.serial.write(0xC4));
-
-        self.until_aux();
-    }
+() /* ~ changed by cargo-mutants ~ */
+}
 
     fn until_aux(&mut self) {
         loop {
             // TODO timeouts?
             match self.aux.is_low() {
                 Ok(true) => continue,
                 Ok(false) => break,
                 // TODO error handling.

---- test::resets stdout ----
thread 'test::resets' panicked at 'serial mock has unsatisfied expectations after call to done', /home/rafaelbachmann/.cargo/registry/src/github.com-1ecc6299db9ec823/embedded-hal-mock-0.8.0/src/serial.rs:340:9

failures:
    test::resets

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.03s

*** cargo result: Exited(101) in 3.244sJFXww7)
