*** replace <??>::set_parameters with Ok(Default::default()) in src/lib.rs:134
*** --- src/lib.rs
+++ replace <??>::set_parameters with Ok(Default::default())
@@ -127,21 +127,18 @@
         if save != 0xC0 {
             return Err(Error::ReadParameters);
         }
         let params = Parameters::from_bytes(&bytes)?;
         Ok(params)
     }
 
     pub fn set_parameters(&mut self, params: &Parameters, mode: Persistence) -> Result<(), Error> {
-        Program::set_pins(&mut self.aux, &mut self.m0, &mut self.m1, &mut self.delay);
-        let result = self.write_parameters(params, mode);
-        Normal::set_pins(&mut self.aux, &mut self.m0, &mut self.m1, &mut self.delay);
-        result
-    }
+Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
+}
 
     fn write_parameters(&mut self, params: &Parameters, mode: Persistence) -> Result<(), Error> {
         let persistence = u8::from(mode);
         block!(self.serial.write(persistence)).map_err(|_| Error::SerialWrite)?;
 
         let bytes: [u8; 5] = params.to_bytes();
         block!(self.serial.write(bytes[0])).map_err(|_| Error::SerialWrite)?;
         block!(self.serial.write(bytes[1])).map_err(|_| Error::SerialWrite)?;

---- test::parameters::write::sets_parameters stdout ----
thread 'test::parameters::write::sets_parameters' panicked at 'serial mock has unsatisfied expectations after call to done', /home/rafaelbachmann/.cargo/registry/src/github.com-1ecc6299db9ec823/embedded-hal-mock-0.8.0/src/serial.rs:340:9
thread 'test::parameters::write::sets_parameters' panicked at 'serial mock has unsatisfied expectations after call to done', /home/rafaelbachmann/.cargo/registry/src/github.com-1ecc6299db9ec823/embedded-hal-mock-0.8.0/src/serial.rs:340:9
thread 'test::parameters::write::sets_parameters' panicked at 'serial mock has unsatisfied expectations after call to done', /home/rafaelbachmann/.cargo/registry/src/github.com-1ecc6299db9ec823/embedded-hal-mock-0.8.0/src/serial.rs:340:9
thread 'test::parameters::write::sets_parameters' panicked at 'serial mock has unsatisfied expectations after call to done', /ho

failures:
    test::parameters::write::sets_parameters

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.51s

*** cargo result: Exited(101) in 2.756san underscore: `_pa
