*** replace <??>::set_parameters with Ok(Default::default()) in src/lib.rs:204
*** --- src/lib.rs
+++ replace <??>::set_parameters with Ok(Default::default())
@@ -197,45 +197,18 @@
         }
 
         let params = Parameters::from_bytes(&bytes)?;
 
         Ok(params)
     }
 
     pub fn set_parameters(&mut self, params: &Parameters, mode: Persistence) -> Result<(), Error> {
-        let persistence = u8::from(mode);
-        block!(self.serial.write(persistence)).map_err(|_| Error::SerialWrite)?;
-
-        let bytes: [u8; 5] = params.to_bytes();
-        block!(self.serial.write(bytes[0])).map_err(|_| Error::SerialWrite)?;
-        block!(self.serial.write(bytes[1])).map_err(|_| Error::SerialWrite)?;
-        block!(self.serial.write(bytes[2])).map_err(|_| Error::SerialWrite)?;
-        block!(self.serial.write(bytes[3])).map_err(|_| Error::SerialWrite)?;
-        block!(self.serial.write(bytes[4])).map_err(|_| Error::SerialWrite)?;
-
-        let response_prefix = block!(self.serial.read()).map_err(|_| Error::SerialRead)?;
-        let mut response = [0u8; 5];
-        for byte in &mut response {
-            *byte = block!(self.serial.read()).map_err(|_| Error::SerialRead)?;
-        }
-        if response_prefix != 0xC0 {
-            return Err(Error::SetParameters);
-        }
-
-        if response != bytes {
-            return Err(Error::SetParameters);
-        }
-
-        self.delay.delay_ms(40);
-
-        self.until_aux();
-
-        Ok(())
-    }
+Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
+}
 
     pub fn reset(&mut self) {
         let _ = block!(self.serial.write(0xC4));
         let _ = block!(self.serial.write(0xC4));
         let _ = block!(self.serial.write(0xC4));
 
         self.until_aux();
     }

---- test::parameters::set_params::sets_parameters stdout ----
thread 'test::parameters::set_params::sets_parameters' panicked at 'serial mock has unsatisfied expectations after call to done', /home/rafaelbachmann/.cargo/registry/src/github.com-1ecc6299db9ec823/embedded-hal-mock-0.8.0/src/serial.rs:340:9
thread 'test::parameters::set_params::sets_parameters' panicked at 'serial mock has unsatisfied expectations after call to done', /home/rafaelbachmann/.cargo/registry/src/github.com-1ecc6299db9ec823/embedded-hal-mock-0.8.0/src/serial.rs:340:9
thread 'test::parameters::set_params::sets_parameters' panicked at 'serial mock has unsatisfied expectations after call to done', /home/rafaelbachmann/.cargo/registry/src/github.com-1ecc6299db9ec823/embedded-hal-mock-0.8.0/src/serial.rs:340:9
thread 'test::parameters::set_params::sets_parameters' panicked at 'serial mock has unsatisfied expectations

failures:
    test::parameters::set_params::sets_parameters

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.61s

*** cargo result: Exited(101) in 2.807s underscore: `_para
