*** replace <??>::write_buffer with Ok(Default::default()) in src/lib.rs:68
*** --- src/lib.rs
+++ replace <??>::write_buffer with Ok(Default::default())
@@ -61,21 +61,18 @@
             mode: PhantomData::<Normal>,
         };
 
         Ok(ebyte)
     }
 
     /// Write entire buffer to serial port
     pub fn write_buffer(&mut self, buffer: &[u8]) -> Result<(), crate::Error> {
-        for ch in buffer {
-            block!(self.serial.write(*ch)).map_err(|_| Error::SerialWrite)?;
-        }
-        Ok(())
-    }
+Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
+}
 
     /// Read entire buffer from serial port
     pub fn read_buffer(&mut self, buffer: &mut [u8]) -> Result<(), Error> {
         for byte in buffer {
             *byte = block!(self.serial.read()).map_err(|_| Error::SerialRead)?;
         }
         Ok(())
     }

---- test::writes_buffer stdout ----
thread 'test::writes_buffer' panicked at 'serial mock has unsatisfied expectations after call to done', /home/rafaelbachmann/.cargo/registry/src/github.com-1ecc6299db9ec823/embedded-hal-mock-0.8.0/src/serial.rs:340:9
thread 'test::writes_buffer' panicked at 'serial mock has unsatisfied expectations after call to done', /home/rafaelbachmann/.cargo/registry/src/github.com-1ecc6299db9ec823/embedded-hal-mock-0.8.0/src/serial.rs:340:9
thread 'test::writes_buffer' panicked at 'serial mock has unsatisfied expectations after call to done', /home/rafaelbachmann/.cargo/registry/src/github.com-1ecc6299db9ec823/embedded-hal-mock-0.8.0/src/serial.rs:340:9
thread 'test::writes_buffer' panicked at 'serial mock has unsatisfied expectations after call to done', /home/rafaelbachmann/.cargo/registry/src/github.com-1ecc6299db9ec823/embedded-hal-mock-0.8.0/src/serial.rs:3

failures:
    test::writes_buffer

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.90s

*** cargo result: Exited(101) in 3.154s |
