*** replace <??>::write_parameters with Ok(Default::default()) in src/lib.rs:141
*** --- src/lib.rs
+++ replace <??>::write_parameters with Ok(Default::default())
@@ -134,43 +134,18 @@
     pub fn set_parameters(&mut self, params: &Parameters, mode: Persistence) -> Result<(), Error> {
         Program::set_pins(&mut self.aux, &mut self.m0, &mut self.m1, &mut self.delay);
         let result = self.write_parameters(params, mode);
         Normal::set_pins(&mut self.aux, &mut self.m0, &mut self.m1, &mut self.delay);
         result
     }
 
     fn write_parameters(&mut self, params: &Parameters, mode: Persistence) -> Result<(), Error> {
-        let persistence = u8::from(mode);
-        block!(self.serial.write(persistence)).map_err(|_| Error::SerialWrite)?;
-
-        let bytes: [u8; 5] = params.to_bytes();
-        block!(self.serial.write(bytes[0])).map_err(|_| Error::SerialWrite)?;
-        block!(self.serial.write(bytes[1])).map_err(|_| Error::SerialWrite)?;
-        block!(self.serial.write(bytes[2])).map_err(|_| Error::SerialWrite)?;
-        block!(self.serial.write(bytes[3])).map_err(|_| Error::SerialWrite)?;
-        block!(self.serial.write(bytes[4])).map_err(|_| Error::SerialWrite)?;
-
-        let response_prefix = block!(self.serial.read()).map_err(|_| Error::SerialRead)?;
-        let mut response = [0u8; 5];
-        for byte in &mut response {
-            *byte = block!(self.serial.read()).map_err(|_| Error::SerialRead)?;
-        }
-        if response_prefix != 0xC0 {
-            return Err(Error::SetParameters);
-        }
-
-        if response != bytes {
-            return Err(Error::SetParameters);
-        }
-
-        self.delay.delay_ms(40);
-
-        Ok(())
-    }
+Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
+}
 
     pub fn reset(&mut self) -> Result<(), Error> {
         Program::set_pins(&mut self.aux, &mut self.m0, &mut self.m1, &mut self.delay);
         let result = self.perform_reset();
         Normal::set_pins(&mut self.aux, &mut self.m0, &mut self.m1, &mut self.delay);
         result
     }

---- test::parameters::write::sets_parameters stdout ----
thread 'test::parameters::write::sets_parameters' panicked at 'serial mock has unsatisfied expectations after call to done', /home/rafaelbachmann/.cargo/registry/src/github.com-1ecc6299db9ec823/embedded-hal-mock-0.8.0/src/serial.rs:340:9
thread 'test::parameters::write::sets_parameters' panicked at 'serial mock has unsatisfied expectations after call to done', /home/rafaelbachmann/.cargo/registry/src/github.com-1ecc6299db9ec823/embedded-hal-mock-0.8.0/src/serial.rs:340:9
thread 'test::parameters::write::sets_parameters' panicked at 'serial mock has unsatisfied expectations after call to done', /home/rafaelbachmann/.cargo/registry/src/github.com-1ecc6299db9ec823/embedded-hal-mock-0.8.0/src/serial.rs:340:9
thread 'test::parameters::write::sets_parameters' panicked at 'serial mock has unsatisfied expectations after call to done', /ho

failures:
    test::parameters::write::sets_parameters

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.55s

*** cargo result: Exited(101) in 2.806snderscore: `_params
