*** replace <??>::write with Ok(Default::default()) in src/lib.rs:217
*** --- src/lib.rs
+++ replace <??>::write with Ok(Default::default())
@@ -210,15 +210,15 @@
     Aux: InputPin,
     M0: OutputPin,
     M1: OutputPin,
     D: DelayMs<u32>,
 {
     type Error = <S as Write<u8>>::Error;
 
     fn write(&mut self, word: u8) -> nb::Result<(), Self::Error> {
-        self.serial.write(word)
-    }
+Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
+}
 
     fn flush(&mut self) -> nb::Result<(), Self::Error> {
         self.serial.flush()
     }
 }

---- test::writes_byte stdout ----
thread 'test::writes_byte' panicked at 'serial mock has unsatisfied expectations after call to done', /home/rafaelbachmann/.cargo/registry/src/github.com-1ecc6299db9ec823/embedded-hal-mock-0.8.0/src/serial.rs:340:9
thread 'test::writes_byte' panicked at 'serial mock has unsatisfied expectations after call to done', /home/rafaelbachmann/.cargo/registry/src/github.com-1ecc6299db9ec823/embedded-hal-mock-0.8.0/src/serial.rs:340:9
thread 'test::writes_byte' panicked at 'serial mock has unsatisfied expectations after call to done', /home/rafaelbachmann/.cargo/registry/src/github.com-1ecc6299db9ec823/embedded-hal-mock-0.8.0/src/serial.rs:340:9
thread 'test::writes_byte' panicked at 'serial mock has unsatisfied expectations after call to done', /home/rafaelbachmann/.cargo/registry/src/github.com-1ecc6299db9ec823/embedded-hal-mock-0.8.0/src/serial.rs:340:9
threa

failures:
    test::writes_byte

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.76s

*** cargo result: Exited(101) in 3.007snused_variables)]` 
