*** replace u8::from with Default::default() in src/parameters/air_baudrate.rs:33
*** --- src/parameters/air_baudrate.rs
+++ replace u8::from with Default::default()
@@ -26,18 +26,11 @@
             5 | 6 | 7 => Ok(Self::Bps19200),
             _ => Err(Error::InvalidBaudrate { rate: value }),
         }
     }
 }
 
 impl From<AirBaudRate> for u8 {
     fn from(rate: AirBaudRate) -> Self {
-        match rate {
-            AirBaudRate::Bps300 => 0,
-            AirBaudRate::Bps1200 => 1,
-            AirBaudRate::Bps2400 => 2,
-            AirBaudRate::Bps4800 => 3,
-            AirBaudRate::Bps9600 => 4,
-            AirBaudRate::Bps19200 => 5,
-        }
-    }
+Default::default() /* ~ changed by cargo-mutants ~ */
+}
 }

---- parameters::test::from_to_bytes_roundtrip stdout ----
thread 'parameters::test::from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 20172, channel: 54, uart_parity: Odd, uart_rate: Bps19200, air_rate: Bps300, transmission_mode: Transparent, io_drive_mode: PushPull, wakeup_time: Ms500, fec: On, transmission_power: Dbm24 }`,
 right: `Parameters { address: 20172, channel: 54, uart_parity: Odd, uart_rate: Bps19200, air_rate: Bps4800, transmission_mode: Transparent, io_drive_mode: PushPull, wakeup_time: Ms500, fec: On, transmission_power: Dbm24 }`', src/parameters/mod.rs:144:13
thread 'parameters::test::from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 10086, channel: 54, uart_parity: Odd, uart_rate: Bps19200, air_rate: Bps300, transmission_mode: Transparent, io_drive_mode: PushPul

---- test::parameters::read_params::reads_parameters stdout ----
thread 'test::parameters::read_params::reads_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 1518, channel: 239, uart_parity: None, uart_rate: Bps38400, air_rate: Bps300, transmission_mode: Fixed, io_drive_mode: PushPull, wakeup_time: Ms500, fec: Off, transmission_power: Dbm30 }`,
 right: `Parameters { address: 1518, channel: 239, uart_parity: None, uart_rate: Bps38400, air_rate: Bps1200, transmission_mode: Fixed, io_drive_mode: PushPull, wakeup_time: Ms500, fec: Off, transmission_power: Dbm30 }`', src/test/parameters/read_params.rs:78:9
thread 'test::parameters::read_params::reads_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 759, channel: 239, uart_parity: None, uart_rate: Bps38400, air_rate: Bps300, transmission_mode: Fixed, io_driv

---- test::parameters::read_params::sets_parameters stdout ----
thread 'test::parameters::read_params::sets_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 1518, channel: 239, uart_parity: None, uart_rate: Bps38400, air_rate: Bps300, transmission_mode: Fixed, io_drive_mode: PushPull, wakeup_time: Ms500, fec: Off, transmission_power: Dbm30 }`,
 right: `Parameters { address: 1518, channel: 239, uart_parity: None, uart_rate: Bps38400, air_rate: Bps1200, transmission_mode: Fixed, io_drive_mode: PushPull, wakeup_time: Ms500, fec: Off, transmission_power: Dbm30 }`', src/test/parameters/read_params.rs:107:9
thread 'test::parameters::read_params::sets_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 759, channel: 239, uart_parity: None, uart_rate: Bps38400, air_rate: Bps300, transmission_mode: Fixed, io_drive_

failures:
    parameters::test::from_to_bytes_roundtrip
    test::parameters::read_params::reads_parameters
    test::parameters::read_params::sets_parameters

test result: FAILED. 15 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.66s

*** cargo result: Exited(101) in 2.907sdefault
