*** replace u8::from with Default::default() in src/parameters/baudrate.rs:37
*** --- src/parameters/baudrate.rs
+++ replace u8::from with Default::default()
@@ -30,20 +30,11 @@
             7 => Ok(Self::Bps115200),
             _ => Err(Error::InvalidBaudrate { rate: value }),
         }
     }
 }
 
 impl From<BaudRate> for u8 {
     fn from(rate: BaudRate) -> Self {
-        match rate {
-            BaudRate::Bps1200 => 0,
-            BaudRate::Bps2400 => 1,
-            BaudRate::Bps4800 => 2,
-            BaudRate::Bps9600 => 3,
-            BaudRate::Bps19200 => 4,
-            BaudRate::Bps38400 => 5,
-            BaudRate::Bps57600 => 6,
-            BaudRate::Bps115200 => 7,
-        }
-    }
+Default::default() /* ~ changed by cargo-mutants ~ */
+}
 }

---- parameters::test::from_to_bytes_roundtrip stdout ----
thread 'parameters::test::from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 20172, channel: 54, uart_parity: Odd, uart_rate: Bps1200, air_rate: Bps4800, transmission_mode: Transparent, io_drive_mode: PushPull, wakeup_time: Ms500, fec: On, transmission_power: Dbm24 }`,
 right: `Parameters { address: 20172, channel: 54, uart_parity: Odd, uart_rate: Bps19200, air_rate: Bps4800, transmission_mode: Transparent, io_drive_mode: PushPull, wakeup_time: Ms500, fec: On, transmission_power: Dbm24 }`', src/parameters/mod.rs:143:13
thread 'parameters::test::from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 10086, channel: 54, uart_parity: Odd, uart_rate: Bps1200, air_rate: Bps4800, transmission_mode: Transparent, io_drive_mode: PushPul

---- test::parameters::read_params::reads_parameters stdout ----
thread 'test::parameters::read_params::reads_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 38344, channel: 139, uart_parity: None, uart_rate: Bps1200, air_rate: Bps19200, transmission_mode: Transparent, io_drive_mode: PushPull, wakeup_time: Ms250, fec: Off, transmission_power: Dbm21 }`,
 right: `Parameters { address: 38344, channel: 139, uart_parity: None, uart_rate: Bps115200, air_rate: Bps19200, transmission_mode: Transparent, io_drive_mode: PushPull, wakeup_time: Ms250, fec: Off, transmission_power: Dbm21 }`', src/test/parameters/read_params.rs:78:9
thread 'test::parameters::read_params::reads_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 19172, channel: 139, uart_parity: None, uart_rate: Bps1200, air_rate: Bps19200, transmission_

---- test::parameters::read_params::sets_parameters stdout ----
thread 'test::parameters::read_params::sets_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 38344, channel: 139, uart_parity: None, uart_rate: Bps1200, air_rate: Bps19200, transmission_mode: Transparent, io_drive_mode: PushPull, wakeup_time: Ms250, fec: Off, transmission_power: Dbm21 }`,
 right: `Parameters { address: 38344, channel: 139, uart_parity: None, uart_rate: Bps115200, air_rate: Bps19200, transmission_mode: Transparent, io_drive_mode: PushPull, wakeup_time: Ms250, fec: Off, transmission_power: Dbm21 }`', src/test/parameters/read_params.rs:107:9
thread 'test::parameters::read_params::sets_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 19172, channel: 139, uart_parity: None, uart_rate: Bps1200, air_rate: Bps19200, transmission_mo

failures:
    parameters::test::from_to_bytes_roundtrip
    test::parameters::read_params::reads_parameters
    test::parameters::read_params::sets_parameters

test result: FAILED. 15 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.68s

*** cargo result: Exited(101) in 2.888swarning: `ebyte-e32
