*** replace u8::from with Default::default() in src/parameters/mod.rs:28
*** --- src/parameters/mod.rs
+++ replace u8::from with Default::default()
@@ -21,21 +21,18 @@
 pub enum Persistence {
     #[default]
     Temporary,
     Permanent,
 }
 
 impl From<Persistence> for u8 {
     fn from(mode: Persistence) -> Self {
-        match mode {
-            Persistence::Temporary => 0xC2,
-            Persistence::Permanent => 0xC0,
-        }
-    }
+Default::default() /* ~ changed by cargo-mutants ~ */
+}
 }
 
 #[derive(Clone, Debug, PartialEq, Eq, TypedBuilder)]
 #[cfg_attr(test, derive(proptest_derive::Arbitrary))]
 pub struct Parameters {
     pub address: u16,
     pub channel: u8,
     #[builder(default)]

*** cargo result: Exited(0) in 3.454swarning: `ebyte-e32` 
