*** replace u8::from with Default::default() in src/parameters/option/fec_mode.rs:25
*** --- src/parameters/option/fec_mode.rs
+++ replace u8::from with Default::default()
@@ -18,14 +18,11 @@
             1 => Ok(Self::On),
             _ => Err(Error::InvalidFecMode { value }),
         }
     }
 }
 
 impl From<ForwardErrorCorrectionMode> for u8 {
     fn from(mode: ForwardErrorCorrectionMode) -> Self {
-        match mode {
-            ForwardErrorCorrectionMode::Off => 0,
-            ForwardErrorCorrectionMode::On => 1,
-        }
-    }
+Default::default() /* ~ changed by cargo-mutants ~ */
+}
 }

---- parameters::test::from_to_bytes_roundtrip stdout ----
thread 'parameters::test::from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 20172, channel: 54, uart_parity: Odd, uart_rate: Bps19200, air_rate: Bps4800, transmission_mode: Transparent, io_drive_mode: PushPull, wakeup_time: Ms500, fec: Off, transmission_power: Dbm24 }`,
 right: `Parameters { address: 20172, channel: 54, uart_parity: Odd, uart_rate: Bps19200, air_rate: Bps4800, transmission_mode: Transparent, io_drive_mode: PushPull, wakeup_time: Ms500, fec: On, transmission_power: Dbm24 }`', src/parameters/mod.rs:143:13
thread 'parameters::test::from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 10086, channel: 54, uart_parity: Odd, uart_rate: Bps19200, air_rate: Bps4800, transmission_mode: Transparent, io_drive_mode: Push

---- test::parameters::read_params::reads_parameters stdout ----
thread 'test::parameters::read_params::reads_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 65268, channel: 101, uart_parity: Odd, uart_rate: Bps4800, air_rate: Bps300, transmission_mode: Fixed, io_drive_mode: PushPull, wakeup_time: Ms250, fec: Off, transmission_power: Dbm27 }`,
 right: `Parameters { address: 65268, channel: 101, uart_parity: Odd, uart_rate: Bps4800, air_rate: Bps300, transmission_mode: Fixed, io_drive_mode: PushPull, wakeup_time: Ms250, fec: On, transmission_power: Dbm27 }`', src/test/parameters/read_params.rs:78:9
thread 'test::parameters::read_params::reads_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 32634, channel: 101, uart_parity: Odd, uart_rate: Bps4800, air_rate: Bps300, transmission_mode: Fixed, io_drive_mo

---- test::parameters::read_params::sets_parameters stdout ----
thread 'test::parameters::read_params::sets_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 9044, channel: 218, uart_parity: None, uart_rate: Bps19200, air_rate: Bps19200, transmission_mode: Fixed, io_drive_mode: PushPull, wakeup_time: Ms1500, fec: Off, transmission_power: Dbm30 }`,
 right: `Parameters { address: 9044, channel: 218, uart_parity: None, uart_rate: Bps19200, air_rate: Bps19200, transmission_mode: Fixed, io_drive_mode: PushPull, wakeup_time: Ms1500, fec: On, transmission_power: Dbm30 }`', src/test/parameters/read_params.rs:107:9
thread 'test::parameters::read_params::sets_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 4522, channel: 218, uart_parity: None, uart_rate: Bps19200, air_rate: Bps19200, transmission_mode: Fixed, io

failures:
    parameters::test::from_to_bytes_roundtrip
    test::parameters::read_params::reads_parameters
    test::parameters::read_params::sets_parameters

test result: FAILED. 15 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.62s

*** cargo result: Exited(101) in 2.805siables)]` on by def
