*** replace u8::from with Default::default() in src/parameters/option/io_drive_mode.rs:25
*** --- src/parameters/option/io_drive_mode.rs
+++ replace u8::from with Default::default()
@@ -18,14 +18,11 @@
             1 => Ok(Self::PushPull),
             _ => Err(Error::InvalidIoDriveMode { value }),
         }
     }
 }
 
 impl From<IoDriveMode> for u8 {
     fn from(mode: IoDriveMode) -> Self {
-        match mode {
-            IoDriveMode::PushPull => 1,
-            IoDriveMode::OpenCollector => 0,
-        }
-    }
+Default::default() /* ~ changed by cargo-mutants ~ */
+}
 }

---- parameters::test::from_to_bytes_roundtrip stdout ----
thread 'parameters::test::from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 20172, channel: 54, uart_parity: Odd, uart_rate: Bps19200, air_rate: Bps4800, transmission_mode: Transparent, io_drive_mode: OpenCollector, wakeup_time: Ms500, fec: On, transmission_power: Dbm24 }`,
 right: `Parameters { address: 20172, channel: 54, uart_parity: Odd, uart_rate: Bps19200, air_rate: Bps4800, transmission_mode: Transparent, io_drive_mode: PushPull, wakeup_time: Ms500, fec: On, transmission_power: Dbm24 }`', src/parameters/mod.rs:143:13
thread 'parameters::test::from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 10086, channel: 54, uart_parity: Odd, uart_rate: Bps19200, air_rate: Bps4800, transmission_mode: Transparent, io_drive_mode:

---- test::parameters::read_params::sets_parameters stdout ----
thread 'test::parameters::read_params::sets_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 57371, channel: 144, uart_parity: Odd, uart_rate: Bps1200, air_rate: Bps4800, transmission_mode: Fixed, io_drive_mode: OpenCollector, wakeup_time: Ms250, fec: Off, transmission_power: Dbm30 }`,
 right: `Parameters { address: 57371, channel: 144, uart_parity: Odd, uart_rate: Bps1200, air_rate: Bps4800, transmission_mode: Fixed, io_drive_mode: PushPull, wakeup_time: Ms250, fec: Off, transmission_power: Dbm30 }`', src/test/parameters/read_params.rs:107:9
thread 'test::parameters::read_params::sets_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 28685, channel: 144, uart_parity: Odd, uart_rate: Bps1200, air_rate: Bps4800, transmission_mode: Fixed, io_d

---- test::parameters::read_params::reads_parameters stdout ----
thread 'test::parameters::read_params::reads_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 27613, channel: 13, uart_parity: Even, uart_rate: Bps115200, air_rate: Bps19200, transmission_mode: Transparent, io_drive_mode: OpenCollector, wakeup_time: Ms500, fec: Off, transmission_power: Dbm21 }`,
 right: `Parameters { address: 27613, channel: 13, uart_parity: Even, uart_rate: Bps115200, air_rate: Bps19200, transmission_mode: Transparent, io_drive_mode: PushPull, wakeup_time: Ms500, fec: Off, transmission_power: Dbm21 }`', src/test/parameters/read_params.rs:78:9
thread 'test::parameters::read_params::reads_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 13806, channel: 13, uart_parity: Even, uart_rate: Bps115200, air_rate: Bps19200, transmi

failures:
    parameters::test::from_to_bytes_roundtrip
    test::parameters::read_params::reads_parameters
    test::parameters::read_params::sets_parameters

test result: FAILED. 15 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.87s

*** cargo result: Exited(101) in 3.073son by default
