*** replace u8::from with Default::default() in src/parameters/option/transmission_mode.rs:25
*** --- src/parameters/option/transmission_mode.rs
+++ replace u8::from with Default::default()
@@ -18,14 +18,11 @@
             1 => Ok(Self::Fixed),
             _ => Err(Error::InvalidTransmissionMode { value }),
         }
     }
 }
 
 impl From<TransmissionMode> for u8 {
     fn from(mode: TransmissionMode) -> Self {
-        match mode {
-            TransmissionMode::Transparent => 0,
-            TransmissionMode::Fixed => 1,
-        }
-    }
+Default::default() /* ~ changed by cargo-mutants ~ */
+}
 }

---- test::parameters::read_params::sets_parameters stdout ----
thread 'test::parameters::read_params::sets_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 1518, channel: 239, uart_parity: None, uart_rate: Bps38400, air_rate: Bps1200, transmission_mode: Transparent, io_drive_mode: PushPull, wakeup_time: Ms500, fec: Off, transmission_power: Dbm30 }`,
 right: `Parameters { address: 1518, channel: 239, uart_parity: None, uart_rate: Bps38400, air_rate: Bps1200, transmission_mode: Fixed, io_drive_mode: PushPull, wakeup_time: Ms500, fec: Off, transmission_power: Dbm30 }`', src/test/parameters/read_params.rs:107:9
thread 'test::parameters::read_params::sets_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 759, channel: 239, uart_parity: None, uart_rate: Bps38400, air_rate: Bps1200, transmission_mode: Transpar

---- parameters::test::from_to_bytes_roundtrip stdout ----
thread 'parameters::test::from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 7631, channel: 247, uart_parity: Odd, uart_rate: Bps38400, air_rate: Bps19200, transmission_mode: Transparent, io_drive_mode: OpenCollector, wakeup_time: Ms250, fec: Off, transmission_power: Dbm24 }`,
 right: `Parameters { address: 7631, channel: 247, uart_parity: Odd, uart_rate: Bps38400, air_rate: Bps19200, transmission_mode: Fixed, io_drive_mode: OpenCollector, wakeup_time: Ms250, fec: Off, transmission_power: Dbm24 }`', src/parameters/mod.rs:144:13
thread 'parameters::test::from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 3815, channel: 247, uart_parity: Odd, uart_rate: Bps38400, air_rate: Bps19200, transmission_mode: Transparent, io_drive_mo

---- test::parameters::read_params::reads_parameters stdout ----
thread 'test::parameters::read_params::reads_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 1518, channel: 239, uart_parity: None, uart_rate: Bps38400, air_rate: Bps1200, transmission_mode: Transparent, io_drive_mode: PushPull, wakeup_time: Ms500, fec: Off, transmission_power: Dbm30 }`,
 right: `Parameters { address: 1518, channel: 239, uart_parity: None, uart_rate: Bps38400, air_rate: Bps1200, transmission_mode: Fixed, io_drive_mode: PushPull, wakeup_time: Ms500, fec: Off, transmission_power: Dbm30 }`', src/test/parameters/read_params.rs:78:9
thread 'test::parameters::read_params::reads_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 759, channel: 239, uart_parity: None, uart_rate: Bps38400, air_rate: Bps1200, transmission_mode: Transp

failures:
    parameters::test::from_to_bytes_roundtrip
    test::parameters::read_params::reads_parameters
    test::parameters::read_params::sets_parameters

test result: FAILED. 15 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.61s

*** cargo result: Exited(101) in 2.857sriables)]` on by de
