*** replace u8::from with Default::default() in src/parameters/option/wakeup_time.rs:37
*** --- src/parameters/option/wakeup_time.rs
+++ replace u8::from with Default::default()
@@ -30,20 +30,11 @@
             7 => Ok(Self::Ms2000),
             _ => Err(Error::InvalidWakeupTime { value }),
         }
     }
 }
 
 impl From<WakeupTime> for u8 {
     fn from(time: WakeupTime) -> Self {
-        match time {
-            WakeupTime::Ms250 => 0,
-            WakeupTime::Ms500 => 1,
-            WakeupTime::Ms750 => 2,
-            WakeupTime::Ms1000 => 3,
-            WakeupTime::Ms1250 => 4,
-            WakeupTime::Ms1500 => 5,
-            WakeupTime::Ms1750 => 6,
-            WakeupTime::Ms2000 => 7,
-        }
-    }
+Default::default() /* ~ changed by cargo-mutants ~ */
+}
 }

---- parameters::test::from_to_bytes_roundtrip stdout ----
thread 'parameters::test::from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 20172, channel: 54, uart_parity: Odd, uart_rate: Bps19200, air_rate: Bps4800, transmission_mode: Transparent, io_drive_mode: PushPull, wakeup_time: Ms250, fec: On, transmission_power: Dbm24 }`,
 right: `Parameters { address: 20172, channel: 54, uart_parity: Odd, uart_rate: Bps19200, air_rate: Bps4800, transmission_mode: Transparent, io_drive_mode: PushPull, wakeup_time: Ms500, fec: On, transmission_power: Dbm24 }`', src/parameters/mod.rs:144:13
thread 'parameters::test::from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 10086, channel: 54, uart_parity: Odd, uart_rate: Bps19200, air_rate: Bps4800, transmission_mode: Transparent, io_drive_mode: PushP

---- test::parameters::read_params::sets_parameters stdout ----
thread 'test::parameters::read_params::sets_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 1518, channel: 239, uart_parity: None, uart_rate: Bps38400, air_rate: Bps1200, transmission_mode: Fixed, io_drive_mode: PushPull, wakeup_time: Ms250, fec: Off, transmission_power: Dbm30 }`,
 right: `Parameters { address: 1518, channel: 239, uart_parity: None, uart_rate: Bps38400, air_rate: Bps1200, transmission_mode: Fixed, io_drive_mode: PushPull, wakeup_time: Ms500, fec: Off, transmission_power: Dbm30 }`', src/test/parameters/read_params.rs:107:9
thread 'test::parameters::read_params::sets_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 759, channel: 239, uart_parity: None, uart_rate: Bps38400, air_rate: Bps1200, transmission_mode: Fixed, io_driv

---- test::parameters::read_params::reads_parameters stdout ----
thread 'test::parameters::read_params::reads_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 1518, channel: 239, uart_parity: None, uart_rate: Bps38400, air_rate: Bps1200, transmission_mode: Fixed, io_drive_mode: PushPull, wakeup_time: Ms250, fec: Off, transmission_power: Dbm30 }`,
 right: `Parameters { address: 1518, channel: 239, uart_parity: None, uart_rate: Bps38400, air_rate: Bps1200, transmission_mode: Fixed, io_drive_mode: PushPull, wakeup_time: Ms500, fec: Off, transmission_power: Dbm30 }`', src/test/parameters/read_params.rs:78:9
thread 'test::parameters::read_params::reads_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 759, channel: 239, uart_parity: None, uart_rate: Bps38400, air_rate: Bps1200, transmission_mode: Fixed, io_dr

failures:
    parameters::test::from_to_bytes_roundtrip
    test::parameters::read_params::reads_parameters
    test::parameters::read_params::sets_parameters

test result: FAILED. 15 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.62s

*** cargo result: Exited(101) in 2.872sn by default
