*** replace u8::from with Default::default() in src/parameters/uart_parity.rs:27
*** --- src/parameters/uart_parity.rs
+++ replace u8::from with Default::default()
@@ -20,15 +20,11 @@
             2 => Ok(Self::Even),
             _ => Err(Error::InvalidUartParity { value }),
         }
     }
 }
 
 impl From<Parity> for u8 {
     fn from(parity: Parity) -> Self {
-        match parity {
-            Parity::None => 0,
-            Parity::Odd => 1,
-            Parity::Even => 2,
-        }
-    }
+Default::default() /* ~ changed by cargo-mutants ~ */
+}
 }

---- parameters::test::from_to_bytes_roundtrip stdout ----
thread 'parameters::test::from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 20172, channel: 54, uart_parity: None, uart_rate: Bps19200, air_rate: Bps4800, transmission_mode: Transparent, io_drive_mode: PushPull, wakeup_time: Ms500, fec: On, transmission_power: Dbm24 }`,
 right: `Parameters { address: 20172, channel: 54, uart_parity: Odd, uart_rate: Bps19200, air_rate: Bps4800, transmission_mode: Transparent, io_drive_mode: PushPull, wakeup_time: Ms500, fec: On, transmission_power: Dbm24 }`', src/parameters/mod.rs:144:13
thread 'parameters::test::from_to_bytes_roundtrip' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 10086, channel: 54, uart_parity: None, uart_rate: Bps19200, air_rate: Bps4800, transmission_mode: Transparent, io_drive_mode: Pus

---- test::parameters::read_params::reads_parameters stdout ----
thread 'test::parameters::read_params::reads_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 60492, channel: 170, uart_parity: None, uart_rate: Bps38400, air_rate: Bps9600, transmission_mode: Transparent, io_drive_mode: PushPull, wakeup_time: Ms1500, fec: Off, transmission_power: Dbm24 }`,
 right: `Parameters { address: 60492, channel: 170, uart_parity: Odd, uart_rate: Bps38400, air_rate: Bps9600, transmission_mode: Transparent, io_drive_mode: PushPull, wakeup_time: Ms1500, fec: Off, transmission_power: Dbm24 }`', src/test/parameters/read_params.rs:78:9
thread 'test::parameters::read_params::reads_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 30246, channel: 170, uart_parity: None, uart_rate: Bps38400, air_rate: Bps9600, transmission_m

---- test::parameters::read_params::sets_parameters stdout ----
thread 'test::parameters::read_params::sets_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 60492, channel: 170, uart_parity: None, uart_rate: Bps38400, air_rate: Bps9600, transmission_mode: Transparent, io_drive_mode: PushPull, wakeup_time: Ms1500, fec: Off, transmission_power: Dbm24 }`,
 right: `Parameters { address: 60492, channel: 170, uart_parity: Odd, uart_rate: Bps38400, air_rate: Bps9600, transmission_mode: Transparent, io_drive_mode: PushPull, wakeup_time: Ms1500, fec: Off, transmission_power: Dbm24 }`', src/test/parameters/read_params.rs:107:9
thread 'test::parameters::read_params::sets_parameters' panicked at 'assertion failed: `(left == right)`
  left: `Parameters { address: 30246, channel: 170, uart_parity: None, uart_rate: Bps38400, air_rate: Bps9600, transmission_mod

failures:
    parameters::test::from_to_bytes_roundtrip
    test::parameters::read_params::reads_parameters
    test::parameters::read_params::sets_parameters

test result: FAILED. 15 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.63s

*** cargo result: Exited(101) in 2.872sy default
